/* 
  D2DateWizard.strings
  Due2

  Created by Lin Junjie on 18/7/13.
  Copyright (c) 2013 Lin Junjie. All rights reserved.
*/

// Pick a plural form rule that is suitable for your language
// Rule #102, extended from 2 to 3 forms by separating 'is 0 or 1'.
// 	  1) is 0
// 	  2) is 1
// 	  3) everything else
"jjPluralForm.rule" = "1";

/**
 *
 * Terms that describe dates relative to now
 *
 * eg. Today, Tomorrow, Yesterday
 *
 **/

"relativeDay.yesterday" = "Yesterday";

"relativeDay.today" = "Today";

// For a time that is less than a minute from now
"relativeDay.now" = "Now";

"relativeDay.tomorrow" = "Tomorrow";

"relativeDay.dayAfterTomorrow" = "";

/**
 *
 * Terms that describe dates relative to now, with time
 *
 * eg. Today 7:00 pm, Tomorrow 8:00 am, Yesterday 2:00 pm
 *
 **/

"formatString.relativeDayWithTime.yesterday" = "Yesterday %@";

"formatString.relativeDayWithTime.today" = "%@ today";

"formatString.relativeDayWithTime.tomorrow" = "Tomorrow %@";

"formatString.relativeDayWithTime.dayAfterTomorrow" = "";

/**
 *
 * Describes how many units of time
 * <N> <unit of time>
 *
 * eg. 1 day, 10 days
 *
 **/

//
// One Character Abbreivation
//

// %1$@ = number, %2$@ = number of time, e.g. 0s, 1h, 10m
"formatString.abbreviated.numberOfUnitTime" = "%1$@%2$@";

// 0s, 1s, 10s
"pluralString.abbreviated.numberOfSeconds" = "s;s";

// 0m, 1m, 10m
"pluralString.abbreviated.numberOfMinutes" = "m;m";

// 0h, 1h, 10h
"pluralString.abbreviated.numberOfHours" = "h;h";

// 0d, 1d, 10d
"pluralString.abbreviated.numberOfDays" = "d;d";

// 0w, 1w, 10w
"pluralString.abbreviated.numberOfWeeks" = "w;w";

// 0m, 1m, 10m
"pluralString.abbreviated.numberOfMonths" = "m;m";

// 0y, 1y, 10y
"pluralString.abbreviated.numberOfYears" = "y;y";

//
// Short, 2-4 characters long
//

// %1$@ = number, %2$@ = number of time, e.g. 0 secs, 1 hr, 10 mins
"formatString.short.numberOfUnitTime" = "%1$@ %2$@";

// 0 secs, 1 sec, 10 secs
"pluralString.short.numberOfSeconds" = "sec;secs";

// 0 mins, 1 min, 10 mins
"pluralString.short.numberOfMinutes" = "min;mins";

// 0 hrs, 1 hr, 10 hrs
"pluralString.short.numberOfHours" = "hr;hrs";

// 0 days, 1 day, 10 days
"pluralString.short.numberOfDays" = "day;days";

// 0 wks, 1 wk, 10 wks
"pluralString.short.numberOfWeeks" = "wk;wks";

// 0 mths, 1 mth, 10 mths
"pluralString.short.numberOfMonths" = "mth;mths";

// 0 yrs, 1 yr, 10 yrs
"pluralString.short.numberOfYears" = "yr;yrs";

//
// Almost full, or 5 characters long
//

// %1$@ = number, %2$@ = number of time, e.g. 0 secs, 1 hour, 10 mins
"formatString.almostFull.numberOfUnitTime" = "%1$@ %2$@";

// 0 secs, 1 sec, 10 secs
"pluralString.almostFull.numberOfSeconds" = "sec;secs";

// 0 mins, 1 min, 10 mins
"pluralString.almostFull.numberOfMinutes" = "min;mins";

// 0 hours, 1 hour, 10 hours
"pluralString.almostFull.numberOfHours" = "hour;hours";

// 0 days, 1 day, 10 days
"pluralString.almostFull.numberOfDays" = "day;days";

// 0 weeks, 1 week, 10 weeks
"pluralString.almostFull.numberOfWeeks" = "week;weeks";

// 0 mths, 1 month, 10 mths
"pluralString.almostFull.numberOfMonths" = "month;mths";

// 0 years, 1 year, 10 years
"pluralString.almostFull.numberOfYears" = "year;years";

//
// Full
//

// %1$@ = number, %2$@ = number of time, e.g. 0 seconds, 1 hour, 10 minutes
"formatString.full.numberOfUnitTime" = "%1$@ %2$@";

// 0 seconds, 1 second, 10 seconds
"pluralString.full.numberOfSeconds" = "second;seconds";

// 0 minutes, 1 minute, 10 minutes
"pluralString.full.numberOfMinutes" = "minute;minutes";

// 0 hours, 1 hour, 10 hours
"pluralString.full.numberOfHours" = "hour;hours";

// 0 days, 1 day, 10 days
"pluralString.full.numberOfDays" = "day;days";

// 0 weeks, 1 week, 10 weeks
"pluralString.full.numberOfWeeks" = "week;weeks";

// 0 months, 1 month, 10 months
"pluralString.full.numberOfMonths" = "month;months";

// 0 years, 1 year, 10 years
"pluralString.full.numberOfYears" = "year;years";

/**
 *
 * Counting down with units of time
 * in <N> <unit of time>
 *
 * eg. in 1 day, in 10 days
 *
 **/

//
// One Character Abbreivation
//

// %1$@ = number, %2$@ = number of time, e.g. in 0s, in 1h, in 10m
"formatString.abbreviated.inNumberOfUnitTime" = "in %1$@%2$@";

"formatString.abbreviated.inLessThanNumberOfUnitTime" = "in <%1$@%2$@";

"formatString.abbreviated.inMoreThanNumberOfUnitTime" = "in >%1$@%2$@";

// 0s, 1s, 10s
"pluralString.abbreviated.inNumberOfSeconds" = "s;s";

// 0m, 1m, 10m
"pluralString.abbreviated.inNumberOfMinutes" = "m;m";

// 0h, 1h, 10h
"pluralString.abbreviated.inNumberOfHours" = "h;h";

// 0d, 1d, 10d
"pluralString.abbreviated.inNumberOfDays" = "d;d";

// 0w, 1w, 10w
"pluralString.abbreviated.inNumberOfWeeks" = "w;w";

// 0m, 1m, 10m
"pluralString.abbreviated.inNumberOfMonths" = "m;m";

// 0y, 1y, 10y
"pluralString.abbreviated.inNumberOfYears" = "y;y";

//
// Short, 2-4 characters long
//

// %1$@ = number, %2$@ = number of time
// e.g. in 0 secs, in 1 hr, in 10 mins
"formatString.short.inNumberOfUnitTime" = "in %1$@ %2$@";

"formatString.short.inLessThanNumberOfUnitTime" = "in < %1$@ %2$@";

"formatString.short.inMoreThanNumberOfUnitTime" = "in > %1$@ %2$@";

// 0 secs, 1 sec, 10 secs
"pluralString.short.inNumberOfSeconds" = "sec;secs";

// 0 mins, 1 min, 10 mins
"pluralString.short.inNumberOfMinutes" = "min;mins";

// 0 hrs, 1 hr, 10 hrs
"pluralString.short.inNumberOfHours" = "hr;hrs";

// 0 days, 1 day, 10 days
"pluralString.short.inNumberOfDays" = "day;days";

// 0 wks, 1 wk, 10 wks
"pluralString.short.inNumberOfWeeks" = "wk;wks";

// 0 mths, 1 mth, 10 mths
"pluralString.short.inNumberOfMonths" = "mth;mths";

// 0 yrs, 1 yr, 10 yrs
"pluralString.short.inNumberOfYears" = "yr;yrs";

//
// Almost full, or 5 characters long
//

// %1$@ = number, %2$@ = number of time
// e.g. in 0 secs, in 1 hour, in 10 mins
"formatString.almostFull.inNumberOfUnitTime" = "in %1$@ %2$@";

"formatString.almostFull.inLessThanNumberOfUnitTime" = "in < %1$@ %2$@";

"formatString.almostFull.inMoreThanNumberOfUnitTime" = "in > %1$@ %2$@";

// 0 secs, 1 sec, 10 secs
"pluralString.almostFull.inNumberOfSeconds" = "sec;secs";

// 0 mins, 1 min, 10 mins
"pluralString.almostFull.inNumberOfMinutes" = "min;mins";

// 0 hours, 1 hour, 10 hours
"pluralString.almostFull.inNumberOfHours" = "hour;hours";

// 0 days, 1 day, 10 days
"pluralString.almostFull.inNumberOfDays" = "day;days";

// 0 weeks, 1 week, 10 weeks
"pluralString.almostFull.inNumberOfWeeks" = "week;weeks";

// 0 mths, 1 month, 10 mths
"pluralString.almostFull.inNumberOfMonths" = "month;mths";

// 0 years, 1 year, 10 years
"pluralString.almostFull.inNumberOfYears" = "year;years";

//
// Full
//

// %1$@ = number, %2$@ = number of time
// e.g. in 0 seconds, in 1 hour, in 10 minutes
"formatString.full.inNumberOfUnitTime" = "in %1$@ %2$@";

"formatString.full.inLessThanNumberOfUnitTime" = "in < %1$@ %2$@";

"formatString.full.inMoreThanNumberOfUnitTime" = "in > %1$@ %2$@";

// 0 seconds, 1 second, 10 seconds
"pluralString.full.inNumberOfSeconds" = "second;seconds";

// 0 minutes, 1 minute, 10 minutes
"pluralString.full.inNumberOfMinutes" = "minute;minutes";

// 0 hours, 1 hour, 10 hours
"pluralString.full.inNumberOfHours" = "hour;hours";

// 0 days, 1 day, 10 days
"pluralString.full.inNumberOfDays" = "day;days";

// 0 weeks, 1 week, 10 weeks
"pluralString.full.inNumberOfWeeks" = "week;weeks";

// 0 months, 1 month, 10 months
"pluralString.full.inNumberOfMonths" = "month;months";

// 0 years, 1 year, 10 years
"pluralString.full.inNumberOfYears" = "year;years";

/**
 *
 * Counting up with units of time
 * <N> <unit of time> ago
 *
 * eg. 1 day ago, 10 days ago
 *
 **/

//
// One Character Abbreivation
//

// %1$@ = number, %2$@ = number of time
// e.g. 0s ago, 1h ago, 10m ago
"formatString.abbreviated.agoNumberOfUnitTime" = "%1$@%2$@ ago";

"formatString.abbreviated.agoLessThanNumberOfUnitTime" = "<%1$@%2$@ ago";

"formatString.abbreviated.agoMoreThanNumberOfUnitTime" = ">%1$@%2$@ ago";

// 0s, 1s, 10s
"pluralString.abbreviated.agoNumberOfSeconds" = "s;s";

// 0m, 1m, 10m
"pluralString.abbreviated.agoNumberOfMinutes" = "m;m";

// 0h, 1h, 10h
"pluralString.abbreviated.agoNumberOfHours" = "h;h";

// 0d, 1d, 10d
"pluralString.abbreviated.agoNumberOfDays" = "d;d";

// 0w, 1w, 10w
"pluralString.abbreviated.agoNumberOfWeeks" = "w;w";

// 0m, 1m, 10m
"pluralString.abbreviated.agoNumberOfMonths" = "m;m";

// 0y, 1y, 10y
"pluralString.abbreviated.agoNumberOfYears" = "y;y";

//
// Short, 2-4 characters long
//

// %1$@ = number, %2$@ = number of time
// e.g. 0 secs ago, 1 hr ago, 10 mins ago
"formatString.short.agoNumberOfUnitTime" = "%1$@ %2$@ ago";

"formatString.short.agoLessThanNumberOfUnitTime" = "< %1$@ %2$@ ago";

"formatString.short.agoMoreThanNumberOfUnitTime" = "> %1$@ %2$@ ago";

// 0 secs, 1 sec, 10 secs
"pluralString.short.agoNumberOfSeconds" = "sec;secs";

// 0 mins, 1 min, 10 mins
"pluralString.short.agoNumberOfMinutes" = "min;mins";

// 0 hrs, 1 hr, 10 hrs
"pluralString.short.agoNumberOfHours" = "hr;hrs";

// 0 days, 1 day, 10 days
"pluralString.short.agoNumberOfDays" = "day;days";

// 0 wks, 1 wk, 10 wks
"pluralString.short.agoNumberOfWeeks" = "wk;wks";

// 0 mths, 1 mth, 10 mths
"pluralString.short.agoNumberOfMonths" = "mth;mths";

// 0 yrs, 1 yr, 10 yrs
"pluralString.short.agoNumberOfYears" = "yr;yrs";

//
// Almost full, or 5 characters long
//

// %1$@ = number, %2$@ = number of time
// e.g. 0 secs ago, 1 hour ago, 10 mins ago
"formatString.almostFull.agoNumberOfUnitTime" = "%1$@ %2$@ ago";

"formatString.almostFull.agoLessThanNumberOfUnitTime" = "< %1$@ %2$@ ago";

"formatString.almostFull.agoMoreThanNumberOfUnitTime" = "> %1$@ %2$@ ago";

// 0 secs, 1 sec, 10 secs
"pluralString.almostFull.agoNumberOfSeconds" = "sec;secs";

// 0 mins, 1 min, 10 mins
"pluralString.almostFull.agoNumberOfMinutes" = "min;mins";

// 0 hours, 1 hour, 10 hours
"pluralString.almostFull.agoNumberOfHours" = "hour;hours";

// 0 days, 1 day, 10 days
"pluralString.almostFull.agoNumberOfDays" = "day;days";

// 0 weeks, 1 week, 10 weeks
"pluralString.almostFull.agoNumberOfWeeks" = "week;weeks";

// 0 mths, 1 month, 10 mths
"pluralString.almostFull.agoNumberOfMonths" = "month;mths";

// 0 years, 1 year, 10 years
"pluralString.almostFull.agoNumberOfYears" = "year;years";

//
// Full
//

// %1$@ = number, %2$@ = number of time
// e.g. 0 seconds ago, 1 hour ago, 10 minutes ago
"formatString.full.agoNumberOfUnitTime" = "%1$@ %2$@ ago";

"formatString.full.agoLessThanNumberOfUnitTime" = "< %1$@ %2$@ ago";

"formatString.full.agoMoreThanNumberOfUnitTime" = "> %1$@ %2$@ ago";

// 0 seconds, 1 second, 10 seconds
"pluralString.full.agoNumberOfSeconds" = "second;seconds";

// 0 minutes, 1 minute, 10 minutes
"pluralString.full.agoNumberOfMinutes" = "minute;minutes";

// 0 hours, 1 hour, 10 hours
"pluralString.full.agoNumberOfHours" = "hour;hours";

// 0 days, 1 day, 10 days
"pluralString.full.agoNumberOfDays" = "day;days";

// 0 weeks, 1 week, 10 weeks
"pluralString.full.agoNumberOfWeeks" = "week;weeks";

// 0 months, 1 month, 10 months
"pluralString.full.agoNumberOfMonths" = "month;months";

// 0 years, 1 year, 10 years
"pluralString.full.agoNumberOfYears" = "year;years";
